{"metadata":{"id":"session-einstellungen","title":"Session Einstellungen","hoverText":"<p>In diesem Bereich können Name, Beschreibung, Freigaben und Verfügbarkeit der Session bearbeitet werden.</p>\n"},"content":"\nZu den *Session Einstellungen* gelangen Sie, wenn Sie im *Meine Sessions* Fenster auf *Neue Session* oder bei vorhandenen Sessions auf das Zahnrad in der Zeile der jeweiligen Session klicken. \n\nIn diesem Bereich haben Sie die Möglichkeit, Name, Beschreibung, Freigaben und Verfügbarkeit der Session zu definieren bzw. zu bearbeiten:\n\n\n#### Allgemeine Informationen\nDie Eingabe eines Namens für die Session ist verpflichtend. Im Feld Beschreibung können Sie optional eine Beschreibung der Session oder auch eine Aufgabenstellung eingeben.\n\n#### Freigaben\nHier legen Sie vorab fest, welche Funktionen für die Teilnehmer\\*innen verfügbar / sichtbar sein werden. Diese Einstellungen lassen sich später innerhalb der Session unter [Freigaben](/docs/terms/Freigaben.md) flexibel ändern.\n\n##### Bearbeitung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Musikstäück mithilfe der Marker annotieren.\n\n##### Player\nDurch Freigabe des Players können die Teilnehmer\\*innen individuell Annotationen erstellen, indem sie den Player von ihrem Gerät aus starten. Diese Freigabe eignet sich für den Fall einer asynchronen Session, z.B. einer Annotationsaufgabe, die zu Hause als Vorbereitung für den Unterricht erstellt wird. Ohne Freigabe des Players kann ausschließlich der Owner eine Annotation starten, indem er den Player auf seinem Gerät startet. Gleichzeitig bewegt sich auch auf dem Bildschirm der Teilnehmer\\*innen ein Cursor auf dem Zeitstrahl und sie können Annotationen setzen. Dieses Szenario eignet sich für synchrone Sessions, z.B. während des Unterrichts. Hier wird der Ton zentral über das Gerät des Owners abgespielt.\n\n##### Musterlösung\nWenn Sie eine eigene Annotation erstellt haben können Sie diese den Teilnehmer\\*innen im Auswertungsfenster zur Verfügung stellen.\n\n##### Auswertung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Auswertungsfenster öffnen.\n\n#### Verfügbarkeit\nNur wenn die Session online geschaltet ist, können Teilnehmer\\*innen auf diese zugreifen. Wenn nicht, ist die Session nur für Sie als Administrator\\*in verfügbar. Alternativ zum Häkchen bei *Online* können Sie auch einen festen Zeitrahmen angeben, in dem die Session verfügbar ist.\n"}