{"docs/terms/Live-Annotation":{"metadata":{"id":"live-annotation","title":"Live Annotation","hoverText":"<p>Sessiontyp, bei dem keine Audiodatei vorhanden ist. Wird im Annotationsfenster gestartet.</p>\n"},"content":"\nText\n"},"docs/terms/Range-Marker":{"metadata":{"id":"range-marker","title":"Range Marker","hoverText":"<p>Der Range Marker erzeugt eine Annotation für einen Bereich mit Start- und Stoppunkt.</p>\n"},"content":"\nMit dem Range-Marker können Teilbereiche auf dem Teitstrahl markiert werden. Start- und Stoppunkte wird durch jeweiliges Drücken des Markers gesetzt. Beim Start wird in der Zeitleiste auf der Spur des Markers eine Box gezeichnet. Beim Beenden der Range wird die Box abgeschlossen.\n"},"docs/terms/Event-Marker":{"metadata":{"id":"event-marker","title":"Event Marker","hoverText":"<p>Event Marker erzeugen punktuelle Annotationen auf der Zeitleiste.</p>\n"},"content":"\nMit dem Event-Marker lassen sich Punkte (events) in der Zeitleiste markieren.\n"},"docs/terms/Slider-Marker":{"metadata":{"id":"slider-marker","title":"Slider Marker","hoverText":"<p>Slider Marker</p>\n"},"content":"\nText\n"},"docs/terms/example-term":{"metadata":{"id":"example-term","title":"Example term","hoverText":"<p>This is an example term</p>\n"},"content":"\nThis is a more detailed explanation for the term. The `hoverText` metadata provides a preview of the explanation.\n"},"docs/terms/Owner":{"metadata":{"id":"owner","title":"Owner","hoverText":"<p>Eine Session ist der Arbeitsbereich von koala.</p>\n"},"content":"\nOwner legen Sessions an und laden Teilnehmer\\*innen ein, der Session beizutreten und Annotationen zu erstellen. Sie sind selbst Teilnehmer\\*in an der Session und moderieren diese in der Regel. Owner einer Session können die Session verwalten und bestimmen, welche Funktionen für die Teilnehmer\\*innen freigegeben werden (siehe hierzu auch [Freigaben]).\n"},"docs/terms/Freigaben":{"metadata":{"id":"freigaben","title":"Freigaben","hoverText":"<p>In diesem Bereich haben Sie die Möglichkeit, Funktionen und Ansichten für die Teilnehmer*innen freizugeben.</p>\n"},"content":"\nRechts oben in der Menüleiste des Sessionfensters befindet sich der Button Freigaben:\n\n![picture](/img/freigaben.png)\n\nIn diesem Bereich haben Sie die Möglichkeit, folgende Funktionen und Ansichten für die Teilnehmer\\*innen freizugeben oder zu sperren:\n\n### Freigaben\n\n#### Bearbeitung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Musikstück mithilfe der Marker annotieren.\n\n#### Player\nDurch Freigabe des Players können die Teilnehmer\\*innen individuell Annotationen erstellen, indem sie den Player von ihrem Gerät aus starten. Diese Freigabe eignet sich für den Fall einer asynchronen Session, z.B. einer Annotationsaufgabe, die zu Hause als Vorbereitung für den Unterricht erstellt wird. Ohne Freigabe des Players kann ausschließlich der Owner eine Annotation starten, indem er den Player auf seinem Gerät startet. Gleichzeitig bewegt sich auch auf dem Bildschirm der Teilnehmer\\*innen ein Cursor auf dem Zeitstrahl und sie können Annotationen setzen. Dieses Szenario eignet sich für synchrone Sessions, z.B. während des Unterrichts. Hier wird der Ton zentral über das Gerät des Owners abgespielt.\n\n#### Musterlösung\nWenn Sie eine eigene Annotation erstellt haben können Sie diese den Teilnehmer\\*innen im Auswertungsfenster zur Verfügung stellen.\n\n#### Auswertung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Auswertungsfenster öffnen.\n\n### Marker\nHier sind alle Marker der Session aufgelistet. Sie können einzelne Marker gezielt ein- und ausblenden und so den Annotationsprozess auch in mehreren Stufen gestalten.  \n"},"docs/terms/Shibboleth":{"metadata":{"id":"shibboleth","title":"Shibboleth","hoverText":"<p>Sicherheitsprotokoll zur Authentifizierung und Autorisierung von Benutzern in verteilten Netzwerken und Web-Anwendungen</p>\n"},"content":"\nUm sich bei *koala* anzumelden, wird das Shibboleth-Verfahren zur Authentifizierung verwendet. Dabei handelt es sich um ein Sicherheitsprotokoll, das den Zugriff auf die Anwendung sicher und geschützt macht.\n\nWenn Sie sich bei *koala* anmelden möchten, werden Sie möglicherweise auf eine separate Login-Seite weitergeleitet, auf der Sie Ihre Zugangsdaten eingeben. Anstatt ein neues Benutzerkonto zu erstellen, können Sie in vielen Fällen Ihr bestehendes Konto einer anderen vertrauenswürdigen Organisation verwenden, wie zum Beispiel einer Universität oder einer Forschungseinrichtung.\n\nSobald Sie Ihre Anmeldedaten eingegeben haben, leitet Sie die Web-App automatisch an Ihren Identity Provider (IdP) weiter. Der IdP ist die Organisation, die Ihre Identität überprüft und bestätigt. Dort werden Sie möglicherweise aufgefordert, sich erneut anzumelden, um Ihre Identität zu verifizieren.\n\nSobald der IdP Ihre Identität bestätigt hat, erhalten Sie ein sogenanntes SAML-Token, das eine digitale Signatur enthält und Informationen über Ihre Berechtigungen und Attribute enthält. Dieses Token wird dann sicher an die Web-App zurückgegeben.\n\n*koala* überprüft das SAML-Token und authentifiziert Sie auf Basis der darin enthaltenen Informationen. Wenn alles erfolgreich verläuft, werden Sie in die Web-App weitergeleitet und können die angebotenen Funktionen und Dienste nutzen.\n\nDie Verwendung von Shibboleth bietet Ihnen mehrere Vorteile, wie zum Beispiel die Verwendung eines einzigen Anmeldevorgangs (Single Sign-On) für verschiedene Dienste, den Schutz Ihrer persönlichen Daten und die sichere Bereitstellung von Ressourcen. Es ermöglicht auch die nahtlose Integration mit anderen Organisationen, die das Shibboleth-Verfahren unterstützen.\n"},"docs/terms/Session-Einstellungen":{"metadata":{"id":"session-einstellungen","title":"Session Einstellungen","hoverText":"<p>In diesem Bereich können Name, Beschreibung, Freigaben und Verfügbarkeit der Session bearbeitet werden.</p>\n"},"content":"\nZu den *Session Einstellungen* gelangen Sie, wenn Sie im *Meine Sessions* Fenster auf *Neue Session* oder bei vorhandenen Sessions auf das Zahnrad in der Zeile der jeweiligen Session klicken. \n\nIn diesem Bereich haben Sie die Möglichkeit, Name, Beschreibung, Freigaben und Verfügbarkeit der Session zu definieren bzw. zu bearbeiten:\n\n\n#### Allgemeine Informationen\nDie Eingabe eines Namens für die Session ist verpflichtend. Im Feld Beschreibung können Sie optional eine Beschreibung der Session oder auch eine Aufgabenstellung eingeben.\n\n#### Freigaben\nHier legen Sie vorab fest, welche Funktionen für die Teilnehmer\\*innen verfügbar / sichtbar sein werden. Diese Einstellungen lassen sich später innerhalb der Session unter [Freigaben](/docs/terms/Freigaben.md) flexibel ändern.\n\n##### Bearbeitung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Musikstäück mithilfe der Marker annotieren.\n\n##### Player\nDurch Freigabe des Players können die Teilnehmer\\*innen individuell Annotationen erstellen, indem sie den Player von ihrem Gerät aus starten. Diese Freigabe eignet sich für den Fall einer asynchronen Session, z.B. einer Annotationsaufgabe, die zu Hause als Vorbereitung für den Unterricht erstellt wird. Ohne Freigabe des Players kann ausschließlich der Owner eine Annotation starten, indem er den Player auf seinem Gerät startet. Gleichzeitig bewegt sich auch auf dem Bildschirm der Teilnehmer\\*innen ein Cursor auf dem Zeitstrahl und sie können Annotationen setzen. Dieses Szenario eignet sich für synchrone Sessions, z.B. während des Unterrichts. Hier wird der Ton zentral über das Gerät des Owners abgespielt.\n\n##### Musterlösung\nWenn Sie eine eigene Annotation erstellt haben können Sie diese den Teilnehmer\\*innen im Auswertungsfenster zur Verfügung stellen.\n\n##### Auswertung\nIst hier ein Häkchen gesetzt, können Teilnehmer\\*innen das Auswertungsfenster öffnen.\n\n#### Verfügbarkeit\nNur wenn die Session online geschaltet ist, können Teilnehmer\\*innen auf diese zugreifen. Wenn nicht, ist die Session nur für Sie als Administrator\\*in verfügbar. Alternativ zum Häkchen bei *Online* können Sie auch einen festen Zeitrahmen angeben, in dem die Session verfügbar ist.\n"},"docs/terms/Audio":{"metadata":{"id":"audio","title":"Audio","hoverText":"<p>Hier können Sie eine Audio-Datei hochladen. Wenn Sie keine Datei hochladen, können Sie eine Live-Annotation innerhalb der Session starten.</p>\n"},"content":"\nText\n"},"docs/terms/Session":{"metadata":{"id":"session","title":"Session","hoverText":"<p>Eine Session ist der Arbeitsbereich von koala.</p>\n"},"content":"\nEine Session ist der Arbeitsbereich von *koala*. Zentraler Bestandteil ist ein Zeitstrahl, der mithilfe von Markern durch die Teilnehmer\\*innen annotiert wird. Der Owner eröffnet, verwaltet und schließt die Session.\n"},"docs/terms/Ansicht":{"metadata":{"id":"ansicht","title":"Ansicht","hoverText":"<p>In diesem Bereich haben Sie die Möglichkeit, Annotationen der Teilnhemer*innen ein- und ausblenden.</p>\n"},"content":"\nRechts oben in der Menüleiste des Auswertungsfensters befindet sich der Button Ansicht:\n\n[//]: # \"![picture](/img/freigaben.png) --> hier richtigen Screenshot einfügen\"\n\nHier lassen sich Annotationen der Teilnhemer\\*innen gezielt ein- und ausblenden.\n"},"docs/terms/Marker":{"metadata":{"id":"marker","title":"Marker","hoverText":"<p>Ein Marker erzeugt eine Annotation auf der Zeitleiste der Audiodatei</p>\n"},"content":"\nEin Marker erzeugt eine Annotation mit einem Label (Text oder Icon) oder einem Text-/Audio-Kommentar.\nMarker markieren entweder (1) ein Event, (2) eine Region mit Start- und Endpunkt oder zeigen einen Wert an.\n\nDem Marker kann eine Farbe zugeordnet werden.\n\nDas Label wird vom Owner festgelegt. Bei Kommentarmarkern wird den TNs ein Beschreibungsfeld angeboten, das mit Kommentaren gefüllt werden kann.\n"},"docs/terms/Annotation":{"metadata":{"id":"annotation","title":"Annotation","hoverText":"<p>Annotationen werden durch Marker erstellt.</p>\n"},"content":"\nAnnotationen werden durch Marker erstellt und sind einer Session, einem TN und einem Zeitpunkt / Bereich auf dem Zeitstrahl der Session zugeordnet. Der Owner kann dabei individuell entscheiden, welche Annotationen für die Teilnehmer*innen sichtbar sein sollen.\n"}}